libretiny-eu/libretiny/boards/wr2le/variant.h
/* This file was auto-generated from wr2le.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         5
#define NUM_DIGITAL_PINS   5
#define NUM_ANALOG_OUTPUTS 0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 0

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 0
